GISTestCoordinateSystem
  extensions [ gis ]
  O> set glob1 gis:load-dataset "test/gis/points.shp"
  gis:envelope-of glob1 => [435619.75166216027 441865.9428709125 4621869.846310603 4649027.199392134]
  O> gis:set-world-envelope [435619 441866 4621869 4649028]
  O> set glob2 gis:feature-list-of glob1 
  gis:location-of first first gis:vertex-lists-of item 0 glob2 => [-0.2748426733503004 -0.21997740391321985]
  gis:location-of first first gis:vertex-lists-of item 1 glob2 => [-1.2647826398702835 5.4996757359798805]
  gis:location-of first first gis:vertex-lists-of item 2 glob2 => [1.2650639412363271 -5.499657225353005]
  O> gis:set-world-envelope-ds [435619 441866 4621869 4649028]
  gis:location-of first first gis:vertex-lists-of item 0 glob2 => [-1.1948858917113507 -0.21997740391321985]
  gis:location-of first first gis:vertex-lists-of item 1 glob2 => [-5.498676439288784 5.4996757359798805]
  gis:location-of first first gis:vertex-lists-of item 2 glob2 => [5.499899404520154 -5.499657225353005]

GISTestProjection
  extensions [ gis ]
  O> gis:load-coordinate-system "test/gis/polygons.prj"
  O> set glob1 gis:load-dataset "test/gis/points.shp"
  O> set glob2 gis:feature-list-of glob1
  O> gis:set-world-envelope [-87.778 -87.699 41.746 41.991]
  gis:location-of first first gis:vertex-lists-of item 0 glob2 => [-0.3487540056354154 -0.218335480134847]
  gis:location-of first first gis:vertex-lists-of item 1 glob2 => [-1.7401163104293709 5.483048399676907]
  gis:location-of first first gis:vertex-lists-of item 2 glob2 => [1.7652601506142278 -5.4764874211644825]

GISTestVectorFeatureProperties
  extensions [ gis ]
  O> set glob1 gis:load-dataset "test/gis/points.shp"
  gis:type-of glob1 => "VECTOR"
  gis:shape-type-of glob1 => "POINT"
  gis:property-names glob1 => ["ID" "TEST1" "TEST2" "TEST3" "TEST4"]
  O> set glob2 gis:feature-list-of glob1
  length glob2 => 3
  gis:property-value item 0 glob2 "ID" => 1
  gis:property-value item 1 glob2 "ID" => 0
  gis:property-value item 2 glob2 "ID" => 2
  gis:property-value item 0 glob2 "TEST1" => ""
  gis:property-value item 1 glob2 "test1" => "this is point one"
  gis:property-value item 2 glob2 "tEsT1" => "this is point three"
  gis:property-value item 0 glob2 "TEST2" => 0
  gis:property-value item 1 glob2 "test2" => 99
  gis:property-value item 2 glob2 "tEsT2" => -99
  gis:property-value item 0 glob2 "TEST3" => 0
  gis:property-value item 1 glob2 "test3" => -99
  gis:property-value item 2 glob2 "tEsT3" => 3.14159
  gis:property-value item 0 glob2 "TEST4" => ""
  gis:property-value item 1 glob2 "test4" => "1974-07-01"
  gis:property-value item 2 glob2 "tEsT4" => "2008-08-06"
  gis:find-one-feature glob1 "TEST1" "*one" = item 1 glob2 => true
  O> set glob3 gis:find-greater-than glob1 "TEST2" 0
  first glob3 = item 1 glob2 => true
  O> set glob3 gis:find-less-than glob1 "TEST2" 0
  first glob3 = item 2 glob2 => true
  gis:property-minimum glob1 "test2" => -99
  gis:property-maximum glob1 "test2" => 99

GISTestVectorFeatureTopology
  extensions [ gis ]
  O> set glob1 gis:load-dataset "test/gis/polygons.shp"
  O> set glob2 gis:find-one-feature glob1 "Id" "0"
  O> set glob3 gis:find-one-feature glob1 "Id" "1"
  gis:contains? glob2 glob3 => false
  gis:contains? glob3 glob2 => false
  gis:intersects? glob2 glob3 => false
  gis:contained-by? glob2 glob3 => false
  O> set glob2 gis:find-one-feature glob1 "Id" "3"
  gis:contains? glob2 glob3 => true
  gis:contains? glob3 glob2 => false
  gis:contained-by? glob3 glob2 => true
  gis:contained-by? glob2 glob3 => false
  gis:intersects? glob2 glob3 => true
  O> set glob3 gis:find-one-feature glob1 "Id" "2"
  gis:contains? glob2 glob3 => false
  gis:contains? glob3 glob2 => false
  gis:contained-by? glob3 glob2 => false
  gis:contained-by? glob2 glob3 => false
  gis:intersects? glob2 glob3 => true
  
GISTestReadAsciiGrid
  extensions [ gis ]
  O> set glob1 gis:load-dataset "test/gis/grid.asc"
  gis:type-of glob1 => "RASTER"
  gis:width-of glob1 => 11
  gis:height-of glob1 => 11
  gis:raster-value glob1 0 0 => 0
  gis:raster-value glob1 1 1 => 9
  gis:raster-value glob1 2 2 => 2
  gis:raster-value glob1 3 3 => -7
  gis:raster-value glob1 4 4 => 0.5
  gis:raster-value glob1 5 5 => 0.6
  gis:raster-value glob1 6 6 => -0.7
  gis:raster-value glob1 7 7 => 0.4
  gis:raster-value glob1 8 8 => 8
  gis:raster-value glob1 9 9 => 1
  gis:raster-value glob1 10 10 => 10

GISTestDraw
  extensions [ gis ]
  O> set glob1 gis:load-dataset "test/gis/points.shp"
  O> gis:draw glob1 2
  O> gis:fill glob1 2
  O> set glob1 gis:load-dataset "test/gis/polygons.shp"
  O> gis:draw glob1 1
  O> gis:fill glob1 2

GISTestPaint
  extensions [ gis ]
  O> set glob1 gis:load-dataset "test/gis/grid.asc"
  O> gis:paint glob1 0
